---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SketchDimensionsRemoved
source: html/d021e4ed-4f2b-95f5-fbe0-c388febc8dc9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SketchDimensionsRemoved Property

The sketch dimensions, that were used to create the sketch, have been removed from the completed rebar shape definition.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchDimensionsRemoved { get; }
```